![title](img/header.png)

## Reading a CSV File

In [1]:
import pandas as pd
data = pd.read_csv('input.csv')
print(data)

   id    name  salary start_date        dept
0   1    Rick  623.30   1/1/2012          IT
1   2     Dan  515.20   23-09-13  Operations
2   3   Tusar  611.00   15-11-14          IT
3   4    Ryan  729.00  11/5/2014          HR
4   5    Gary  843.25   27-03-15     Finance
5   6   Rasmi  578.00   21-05-13          IT
6   7  Pranab  632.80   30-07-13  Operations
7   8    Guru  722.50   17-06-14     Finance

### Reading Specific Rows

In [2]:
data = pd.read_csv('input.csv')

#slice the result for first 5 rows
print(data[:5]['salary'])

0    623.30
1    515.20
2    611.00
3    729.00
4    843.25
Name: salary, dtype: float64

### Reading Specific Columns

In [3]:
data = pd.read_csv('input.csv')

print(data.loc[:,['salary','name']])

   salary    name
0  623.30    Rick
1  515.20     Dan
2  611.00   Tusar
3  729.00    Ryan
4  843.25    Gary
5  578.00   Rasmi
6  632.80  Pranab
7  722.50    Guru

### Reading Specific Columns & Rows

In [4]:
print(data.loc[[1,3,5],['salary','name']])

print()

print(data.loc[2:6,['salary','name']])

   salary   name
1   515.2    Dan
3   729.0   Ryan
5   578.0  Rasmi

   salary    name
2  611.00   Tusar
3  729.00    Ryan
4  843.25    Gary
5  578.00   Rasmi
6  632.80  Pranab

## Processing JSON Data

In [5]:
data = pd.read_json('input.json')

print(data)

         dept  id    name  salary start_date
0          IT   1    Rick  623.30   1/1/2012
1  Operations   2     Dan  515.20   23-09-13
2          IT   3   Tusar  611.00   15-11-14
3          HR   4    Ryan  729.00  11/5/2014
4     Finance   5    Gary  843.25   27-03-15
5          it   6   Rasmi  578.00   21-05-13
6  Operations   7  Pranab  632.80   30-07-13
7     Finance   8    Guru  722.50   17-06-14

### Reading Specific Columns and Rows

In [6]:
print(data.loc[[1,3,5],['salary','name']])

print()

print(data.loc[2:6,['salary','name']])

   salary   name
1   515.2    Dan
3   729.0   Ryan
5   578.0  Rasmi

   salary    name
2  611.00   Tusar
3  729.00    Ryan
4  843.25    Gary
5  578.00   Rasmi
6  632.80  Pranab

### Reading to Json view

In [7]:
print(data.to_json(orient='records',lines=True))

{"dept":"  IT","id":1,"name":"Rick","salary":623.3,"start_date":"1\/1\/2012"}
{"dept":"Operations","id":2,"name":"Dan","salary":515.2,"start_date":"23-09-13"}
{"dept":"IT","id":3,"name":"Tusar","salary":611.0,"start_date":"15-11-14"}
{"dept":"HR","id":4,"name":"Ryan","salary":729.0,"start_date":"11\/5\/2014"}
{"dept":"Finance","id":5,"name":"Gary","salary":843.25,"start_date":"27-03-15"}
{"dept":"it","id":6,"name":"Rasmi","salary":578.0,"start_date":"21-05-13"}
{"dept":"Operations","id":7,"name":"Pranab","salary":632.8,"start_date":"30-07-13"}
{"dept":"Finance","id":8,"name":"Guru","salary":722.5,"start_date":"17-06-14"}

### Processing Excel Data

In [8]:
data = pd.read_excel('input.xlsx')

print(data)

      id    name  salary start_date        dept
0      1    Rick  623.30 2012-01-01          IT
1      2     Dan  515.20 2013-09-23  Operations
2      3   Tusar  611.00 2014-11-15          IT
3      4    Ryan  729.00 2014-11-05          HR
4      5    Gary  843.25 2015-03-27     Finance
5      6   Rasmi  578.00 2013-05-21          it
6      7  Pranab  632.80 2013-07-30  Operations
7      8    Guru  722.50 2014-06-17     Finance

### Reading Specific Columns and Rows

In [9]:
print(data.loc[[1,3,5],['salary','name']])

print()

print(data.loc[2:6,['salary','name']])

   salary   name
1   515.2    Dan
3   729.0   Ryan
5   578.0  Rasmi

   salary    name
2  611.00   Tusar
3  729.00    Ryan
4  843.25    Gary
5  578.00   Rasmi
6  632.80  Pranab

### Reading Multiple Excel Sheets

In [10]:
with pd.ExcelFile('input.xlsx') as xls:
    df1 = pd.read_excel(xls,'Sheet1')
    df2 = pd.read_excel(xls,'Sheet2')
    
print("Hasil Sheet 1:")
print(df1[:5]['salary'])
print()
print("Hasil Sheet 2:")
print(df2[:5]['zipcode'])

Hasil Sheet 1:
0    623.30
1    515.20
2    611.00
3    729.00
4    843.25
Name: salary, dtype: float64

Hasil Sheet 2:
0     857353
1    8734345
2    5345326
3     893242
4    3532352
Name: zipcode, dtype: int64

### Reading a CSV File as Relational DB

In [11]:
from sqlalchemy import create_engine
data = pd.read_csv('input.csv')

# create db engine
engine = create_engine('sqlite:///:memory:')

# store df as a table
data.to_sql('data_table',engine)

# coba Query 1
res1 = pd.read_sql_query('SELECT * FROM data_table', engine)
print('Hasil 1:')
print(res1)
print()

# coba Query 2
res2 = pd.read_sql_query('SELECT dept,sum(salary) FROM data_table group by dept', engine)
print('Hasil 2:')
print(res2)

Hasil 1:
   index  id    name  salary start_date        dept
0      0   1    Rick  623.30   1/1/2012          IT
1      1   2     Dan  515.20   23-09-13  Operations
2      2   3   Tusar  611.00   15-11-14          IT
3      3   4    Ryan  729.00  11/5/2014          HR
4      4   5    Gary  843.25   27-03-15     Finance
5      5   6   Rasmi  578.00   21-05-13          IT
6      6   7  Pranab  632.80   30-07-13  Operations
7      7   8    Guru  722.50   17-06-14     Finance

Hasil 2:
         dept  sum(salary)
0     Finance      1565.75
1          HR       729.00
2          IT      1812.30
3  Operations      1148.00

### Inserting Data to Relational Tables

In [12]:
from pandas.io import sql
from sqlalchemy import create_engine
data = pd.read_csv('input.csv')

# create db engine
engine = create_engine('sqlite:///:memory:')

# store df as a table
data.to_sql('data_table',engine)

# coba insert data
sql.execute('INSERT INTO data_table VALUES(?,?,?,?,?,?)', engine, params=['id',9,'Ruby',711.20,'27/03/27','IT'])

# read from Relational table
res = pd.read_sql_query('SELECT id,dept,name,salary,start_date FROM data_table', engine)
print(res)

   id        dept    name  salary start_date
0   1          IT    Rick  623.30   1/1/2012
1   2  Operations     Dan  515.20   23-09-13
2   3          IT   Tusar  611.00   15-11-14
3   4          HR    Ryan  729.00  11/5/2014
4   5     Finance    Gary  843.25   27-03-15
5   6          IT   Rasmi  578.00   21-05-13
6   7  Operations  Pranab  632.80   30-07-13
7   8     Finance    Guru  722.50   17-06-14
8   9          IT    Ruby  711.20   27/03/27

#### Deleting Data to Relational Tables

In [13]:
# coba delete data
sql.execute('Delete from data_table where name=(?)', engine, params=[('Gary')])

# read from Relational table
res = pd.read_sql_query('SELECT id,dept,name,salary,start_date FROM data_table', engine)
print(res)

   id        dept    name  salary start_date
0   1          IT    Rick   623.3   1/1/2012
1   2  Operations     Dan   515.2   23-09-13
2   3          IT   Tusar   611.0   15-11-14
3   4          HR    Ryan   729.0  11/5/2014
4   6          IT   Rasmi   578.0   21-05-13
5   7  Operations  Pranab   632.8   30-07-13
6   8     Finance    Guru   722.5   17-06-14
7   9          IT    Ruby   711.2   27/03/27

![title](img/thumbs-up.png)